---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet{System.Boolean})
source: html/0dd5676c-aaa3-eed5-5d87-3da3a33541ea.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	ISet<bool> values
)
```

## Parameters
- **name** (`System.String`)
- **values** (`System.Collections.Generic.ISet < Boolean >`)